УТ_для_edt/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаПартнеров</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>ДатаРегистрацииСвязи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Ключевой</name>
    <comment>Ключевой контакт</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЛичныеИнтересы</name>
    <comment>Личные интересы контактного лица</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НапоминатьОДнеРождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольКонтактногоЛица</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЭлектроннаяПочтаНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЛогинНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Состояние</name>
    <type>
      <types>EnumRef.CRM_Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СтатусыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеровПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Должность</name>
    <type>
      <types>CatalogRef.CRM_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияСвязи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоВизитке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпПользовательДляПереключенияЗвонков</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Взаимодействия</name>
    <comment>Взаимодействия</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ВладелецБизнеса</name>
    <comment>Владелец бизнеса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Заказчик</name>
    <comment>Заказчик</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Противник</name>
    <comment>Противник</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Прочее</name>
    <comment>Прочее</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Спонсор</name>
    <comment>Спонсор</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Сторонник</name>
    <comment>Сторонник</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ТипОтношенийПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартТелефонНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартИдентификаторБитрикс</name>
    <comment>//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка &quot;Личный кабинет&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартАктивностьНаСайте</name>
    <comment>//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка &quot;Личный кабинет&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиКонтактногоЛица</name>
    <attributes>
      <name>РольКонтактногоЛица</name>
      <type>
        <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_КлючевыеСобытия</name>
    <comment>Ключевые события контакта</comment>
    <attributes>
      <name>ВидСобытия</name>
      <comment>Вид ключевого события</comment>
      <type>
        <types>CatalogRef.CRM_ВидыКлючевыхСобытий</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСобытия</name>
      <comment>Дата ключевого события</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НапоминатьОСобытии</name>
      <comment>Напоминать о ключевом событии</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Статусы</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.CRM_СтатусыКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/CRM_ДублиКлиентовИКонтактов/CRM_ДублиКлиентовИКонтактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ДублиКлиентовИКонтактов</name>
  <resources>
    <name>Оригинал</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>Заменить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Контакт</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/КонтактныеЛицаПартнеров/Forms/CRM_ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("CRM_УправлениеДоступом");
	Если МодульУправлениеДоступом <> Неопределено Тогда
		МодульУправлениеДоступом.ОграничитьВыводКлиентскойБазы(ЭтотОбъект, "Список");
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекДата", CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса());
	КоличествоПолейПоиска = 1;    
	Элементы.Список.ПоложениеСтрокиПоиска = ПоложениеСтрокиПоиска.Нет;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущаяСтрока <> Неопределено И Элемент.ВыделенныеСтроки.Количество() = 1 Тогда
		ПервыйИзВыделенных = Элемент.ТекущаяСтрока;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// +СофтФон

&НаКлиенте
// Процедура - обработчик команды формы "Позвонить".
//
Процедура Позвонить(Команда)
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	СписокОбъектов = Новый СписокЗначений;
	СписокОбъектов.Добавить(ТД.Ссылка);
	сфпСофтФонПроКлиент.сфпПозвонитьВыбравТелефон(СписокОбъектов);
КонецПроцедуры // Позвонить()

// -СофтФон

#Область ДублиКонтактов

&НаСервере
Процедура Дубли_СвязатьВыбранныеНаСервере(Знач Дубли)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	CRM_ДублиКлиентовИКонтактов.Оригинал КАК Оригинал
	                      |ИЗ
	                      |	РегистрСведений.CRM_ДублиКлиентовИКонтактов КАК CRM_ДублиКлиентовИКонтактов
	                      |ГДЕ
	                      |	CRM_ДублиКлиентовИКонтактов.Оригинал В(&Оригинал)");
	Запрос.УстановитьПараметр("Оригинал", Дубли);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Оригинал = Выборка.Оригинал;
	Иначе
		Оригинал = ПервыйИзВыделенных;
	КонецЕсли;
	Дубли.Удалить(Дубли.Найти(Оригинал));
	Для каждого Дубль из Дубли цикл
		РегистрыСведений.CRM_ДублиКлиентовИКонтактов.ЗаписатьДубль(Оригинал, Дубль);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Дубли_СвязатьВыбранные(Команда)
	Дубли_СвязатьВыбранныеНаСервере(Элементы.Список.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура Дубли_ПоискДублей(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Настройки", Новый Структура("Настройки_ИскатьДублиКонтактов", Истина));
	ПараметрыФормы.Вставить("СкрытьГруппуКлиенты", Истина);
	ОткрытьФорму("Обработка.CRM_ПоискИЗаменаДублейКлиентовИКонтактов.Форма.Форма", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Поиск

&НаКлиенте
Процедура УдалитьПолеПоиска(Команда)
	
	Элементы["ГруппаПоиска"+Строка(КоличествоПолейПоиска-1)].Видимость = Ложь;
	Элементы["УдалитьПолеПоиска"+Строка(КоличествоПолейПоиска-1)].Видимость = Ложь;
	Если КоличествоПолейПоиска > 2 Тогда
		Элементы["УдалитьПолеПоиска"+Строка(КоличествоПолейПоиска-2)].Видимость = Истина;
	КонецЕсли;
	Элементы["ДобавитьПолеПоиска"+Строка(КоличествоПолейПоиска-2)].Видимость = Истина;
	Если ЭтотОбъект["СтрокаПоискаДоп"+Строка(КоличествоПолейПоиска-1)] <> "" Тогда
		ЭтотОбъект["СтрокаПоискаДоп"+Строка(КоличествоПолейПоиска-1)] = "";
		ВыполнитьПоиск(Истина);
	КонецЕсли;
	КоличествоПолейПоиска = КоличествоПолейПоиска - 1;
	
КонецПроцедуры    

&НаКлиенте
Процедура ДобавитьПолеПоиска(Команда)
	
	Элементы["ГруппаПоиска"+Строка(КоличествоПолейПоиска)].Видимость = Истина;
	Элементы["ДобавитьПолеПоиска"+Строка(КоличествоПолейПоиска-1)].Видимость = Ложь;
	Если КоличествоПолейПоиска > 1 Тогда
		Элементы["УдалитьПолеПоиска"+Строка(КоличествоПолейПоиска-1)].Видимость = Ложь;
	КонецЕсли;
	Элементы["УдалитьПолеПоиска"+Строка(КоличествоПолейПоиска)].Видимость = Истина;
	КоличествоПолейПоиска = КоличествоПолейПоиска + 1;
	
КонецПроцедуры    

&НаКлиенте
Процедура СтрокаПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СпособыПоиска = Новый СписокЗначений;
	СпособыПоиска.Добавить(0, НСтр("ru = 'По началу строки'"));
	СпособыПоиска.Добавить(1, НСтр("ru = 'По части строки'"));
	СпособыПоиска.Добавить(2, НСтр("ru = 'По точному совпадению'"));
	
	НайденныйЭлемент = СпособыПоиска.НайтиПоЗначению(СпособПоиска);
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Пометка = Истина;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СтрокаПоискаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	ПоказатьВыборИзМеню(ОповещениеЗавершения, СпособыПоиска, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	ВыполнитьПоиск(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоиск(ОповещатьОбОшибках)
	
	ОбрабатыватьАктивизациюПоиска = Истина;
	
	СтрокаПоиска = СокрЛП(СтрокаПоиска);
	Для Сч = 1 По 3 Цикл
		ИмяПоля = "СтрокаПоискаДоп"+Строка(Сч);
		ЭтотОбъект[ИмяПоля] = СокрЛП(ЭтотОбъект[ИмяПоля]);
	КонецЦикла;
	
	// Проверка возможности поиска.
	Отказ = Ложь;
	ТекстСообщения = НСтр("ru='Минимальная длина строки поиска 3 символа.';en='Minimum length of the search line is 3 characters.'");
	Если ОповещатьОбОшибках И СтрДлина(СтрокаПоиска) < 3  И СтрДлина(СтрокаПоиска) > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "СтрокаПоиска",, Отказ);
	КонецЕсли;	
	Для Сч = 1 По 3 Цикл
		ИмяПоля = "СтрокаПоискаДоп"+Строка(Сч);
		Если ОповещатьОбОшибках И СтрДлина(ЭтотОбъект[ИмяПоля]) < 3  И СтрДлина(ЭтотОбъект[ИмяПоля]) > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ИмяПоля,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьПоискНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискНаСервере(УсловияПоиска = Неопределено)
	CRM_ТаблицаНайденныхСсылок.Очистить();
	CRM_РезультатыПоиска = "";
	Если УсловияПоиска = Неопределено Тогда
		
		// Анализ строк поиска, формализация условий и заполнение кэша.
		КэшПоиска = CRM_ПоискКонтактов.СтруктураДанныхКэша();
		КэшЗаполнения = CRM_ПоискКонтактов.СтруктураДанныхКэша();
		УсловияПоиска = Новый Массив;
		Если Не ПустаяСтрока(СтрокаПоиска) Тогда
			СтрокаПоискаНормализованная = CRM_ПоискКонтактов.НормализоватьСтрокуПоискаИДополнитьКэш(СтрокаПоиска, КэшПоиска, КэшЗаполнения);
			УсловияПоиска.Добавить(СтрокаПоискаНормализованная);
		КонецЕсли;
		Для Сч = 1 По 3 Цикл
			ТекущаяСтрокаПоиска = ЭтотОбъект["СтрокаПоискаДоп" + Сч];
			Если Не ПустаяСтрока(ТекущаяСтрокаПоиска) Тогда
				СтрокаПоискаНормализованная = CRM_ПоискКонтактов.НормализоватьСтрокуПоискаИДополнитьКэш(ТекущаяСтрокаПоиска, КэшПоиска, КэшЗаполнения);
				УсловияПоиска.Добавить(СтрокаПоискаНормализованная);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Поиск.
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Новый СписокЗначений, ВидСравненияКомпоновкиДанных.ВСписке, , Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Элементы.СтрокаПоиска.ЦветФона = Новый Цвет(255, 255, 255);
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
		Возврат;
	КонецЕсли;	
	Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	УстановитьПривилегированныйРежим(Истина);
	РезультатПоиска = CRM_ПоискКонтактов.ВыполнитьПоискКонтактов(УсловияПоиска, СпособПоиска, Истина, Истина);
	УстановитьПривилегированныйРежим(Ложь);
	Если ЗначениеЗаполнено(РезультатПоиска.КодОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Новый СписокЗначений, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Элементы.СтрокаПоиска.ЦветФона = Новый Цвет(255, 200, 200);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ тмпСсылки
	               |ИЗ
	               |	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	               |ГДЕ
	               |	КонтактныеЛицаПартнеров.Ссылка В(&Массивссылок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	тмпСсылки.Ссылка КАК Ссылка
	               |ИЗ
	               |	тмпСсылки КАК тмпСсылки";
	Запрос.УстановитьПараметр("Массивссылок", РезультатПоиска.Элементы);
	СписоСсылокДляОтбора = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", СписоСсылокДляОтбора, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Если СписоСсылокДляОтбора.Количество() = 0 Тогда
		Элементы.СтрокаПоиска.ЦветФона = Новый Цвет(255, 200, 200);
	Иначе
		Элементы.СтрокаПоиска.ЦветФона = Новый Цвет(255, 255, 255);
	КонецЕсли;	
	CRM_ТаблицаНайденныхСсылок.Загрузить(РезультатПоиска.ТаблицаРезультатов);	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособПоиска <> ВыбранныйЭлемент.Значение Тогда
		СпособПоиска = ВыбранныйЭлемент.Значение;
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_МастерРегистрацииОбращения.СпособПоиска","СправочникПартнеры", СпособПоиска);
		ВыполнитьПоиск(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТиповойПоиск(Команда)
	Элементы.ФормаИспользоватьТиповойПоиск.Пометка = НЕ Элементы.ФормаИспользоватьТиповойПоиск.Пометка;
	Элементы.ГруппаДополнительныеПоляПоиска.Видимость = НЕ Элементы.ФормаИспользоватьТиповойПоиск.Пометка; 
	Элементы.ГруппаРезультатыПоиска.Видимость = НЕ Элементы.ФормаИспользоватьТиповойПоиск.Пометка;
	СтрокаПоиска = "";
	СтрокаПоискаCRM = "";
	СтрокаПоискаДоп1 = "";
	СтрокаПоискаДоп2 = "";
	СтрокаПоискаДоп3 = "";
	ВыполнитьПоиск(Ложь);     
	
	Элементы.Список.ПоложениеСтрокиПоиска = ?(Элементы.ФормаИспользоватьТиповойПоиск.Пометка, ПоложениеСтрокиПоиска.Авто, ПоложениеСтрокиПоиска.Нет);
КонецПроцедуры

&НаКлиенте
Процедура CRM_РезультатыПоискаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(CRM_НайденнаяСсылка) = Тип("СправочникСсылка.Партнеры") Тогда
		Открытьформу("Справочник.Партнеры.ФормаОбъекта", Новый Структура("Ключ", CRM_НайденнаяСсылка));
	ИначеЕсли ТипЗнч(CRM_НайденнаяСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда	
		Открытьформу("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("Ключ", CRM_НайденнаяСсылка));
	ИначеЕсли ТипЗнч(CRM_НайденнаяСсылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда	
		Открытьформу("Справочник.КонтактныеЛицаПартнеров.ФормаОбъекта", Новый Структура("Ключ", CRM_НайденнаяСсылка));
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиСписка()
	
		// +CRM
	CRM_РезультатыПоиска = "";
		
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда		
		CRM_СформироватьСтрокуРезультатаПоиска(Элементы.Список.ТекущаяСтрока);
	КонецЕсли;	
	// -CRM
	
КонецПроцедуры   

&НаСервере
Процедура CRM_СформироватьСтрокуРезультатаПоиска(Контакт)
	CRM_РезультатыПоиска = "";
	СтруктураПоиска = Новый Структура("Владелец", Контакт);
	МассивСтрок = CRM_ТаблицаНайденныхСсылок.НайтиСтроки(СтруктураПоиска);
	CRM_НайденнаяСсылка = Неопределено;
	Если МассивСтрок.Количество() > 0 Тогда
		
		СтрокаНайденного = МассивСтрок[0];
		CRM_НайденнаяСсылка = СтрокаНайденного.Владелец;
		Если ТипЗнч(СтрокаНайденного.Владелец) = Тип("СправочникСсылка.Партнеры") Тогда
			ВидСправочника = "партнера";
		ИначеЕсли ТипЗнч(СтрокаНайденного.Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда	
			ВидСправочника = "контрагента";
		ИначеЕсли ТипЗнч(СтрокаНайденного.Владелец) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда	
			ВидСправочника = "контактного лица";
		КонецЕсли;	
		CRM_РезультатыПоиска = "Найдено в реквизите " + ВидСправочника + " " + СтрокаНайденного.Владелец + " '" + СтрокаНайденного.ПолеПоиска + "': " + СтрокаНайденного.ЗначениеПоиска;// + СтрокаНайденного.Партнер+"/"+СтрокаНайденного.Владелец+"/"+СтрокаНайденного.ВидКонтактнойИнформации+"/"+СтрокаНайденного.ЗначениеПоиска+"/";
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
